Tekla Open API Reference for Tekla Structures 2025
LineTypes.Inequality Operator
 Returns true if the current object and the given object are not equal.
 Namespace: Tekla.Structures.Drawing
 Assembly: Tekla.Structures.Drawing (in Tekla.Structures.Drawing.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public static bool operator !=(
	LineTypes a,
	LineTypes b
)
Public Shared Operator <> (
	a As LineTypes,
	b As LineTypes
) As Boolean
Parameters
a
Type: Tekla.Structures.Drawing.LineTypes
The first object we wish to check the inequality with.
b
Type: Tekla.Structures.Drawing.LineTypes
The second object we wish to check the inequality with.
Return Value
Type: Boolean
True if the objects are not equal.
See Also
Reference
LineTypes Class
Tekla.Structures.Drawing Namespace